Revit 2026 API

# BuiltInFailuresCurveByPointFailures Class

---

Failures about Curve By Point Element

SystemObject Autodesk.Revit.DBBuiltInFailuresCurveByPointFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class CurveByPointFailures
```
```vb
Public NotInheritable Class CurveByPointFailures
```
```cpp
public ref class CurveByPointFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type CurveByPointFailures = class end
```

The BuiltInFailuresCurveByPointFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UnableToGenerateCurve | Unable to generate valid curve geometry from the driving points. The line by points will be dissolved. |

#### Reference

Autodesk.Revit.DB Namespace